In [6]:
import pandas as pd
import numpy as np

In [356]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [357]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# Q1

In [358]:
df['FlightNumber'].fillna({1:10055,3:10075},axis=0,inplace=True)

In [359]:
df['FlightNumber']=df['FlightNumber'].astype(int)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

# Q2

In [360]:
l1=[df['From_To'][i].split('_').pop(0) for i in range(len(df))]
Temp=[df['From_To'][i].split('_').pop(1) for i in range(len(df))]

In [361]:
df['From_To'].update(l1)

In [362]:
df

    From_To  FlightNumber  RecentDelays              Airline
0    LoNDon         10045      [23, 47]               KLM(!)
1    MAdrid         10055            []    <Air France> (12)
2    londON         10065  [24, 43, 87]  (British Airways. )
3  Budapest         10075          [13]       12. Air France
4  Brussels         10085      [67, 32]          "Swiss Air"

# Q3

In [363]:
def cap(word):
    c=word[1:].lower()
    k=word[0:1].upper()
    return k+c

In [364]:
df['From_To'].update(df['From_To'].apply(cap))

In [365]:
df

    From_To  FlightNumber  RecentDelays              Airline
0    London         10045      [23, 47]               KLM(!)
1    Madrid         10055            []    <Air France> (12)
2    London         10065  [24, 43, 87]  (British Airways. )
3  Budapest         10075          [13]       12. Air France
4  Brussels         10085      [67, 32]          "Swiss Air"

# Q4

In [366]:
df.drop('From_To',axis=1,inplace=True)

In [367]:
df.insert(0,'Temp',Temp)

In [368]:
df['Temp'].update(df['Temp'].apply(cap))

In [369]:
df

        Temp  FlightNumber  RecentDelays              Airline
0      Paris         10045      [23, 47]               KLM(!)
1      Milan         10055            []    <Air France> (12)
2  Stockholm         10065  [24, 43, 87]  (British Airways. )
3      Paris         10075          [13]       12. Air France
4     London         10085      [67, 32]          "Swiss Air"

# Q5

In [370]:
l=[df['RecentDelays'][i] for i in range(len(df['RecentDelays']))]
l

[[23, 47], [], [24, 43, 87], [13], [67, 32]]

In [371]:
lst=[]
for j in range(3):
    pst=[]
    for i in range(len(l)):
        try:
            pst.append(l[i][j])
        except:
            pst.append(np.nan)
    lst.append(pst)
print(lst)

[[23, nan, 24, 13, 67], [47, nan, 43, nan, 32], [nan, nan, 87, nan, nan]]

In [372]:
df1=pd.DataFrame(lst).transpose().rename(columns={0:'delay_1',1:'delay_2',2:'delay_3'})

In [373]:
df1

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [374]:
df.drop('RecentDelays',axis=1,inplace=True)

In [375]:
df2=df.pop('Airline')

In [377]:
df3=pd.concat([df,df1,df2],axis=1)
df3

        Temp  FlightNumber  delay_1  delay_2  delay_3              Airline
0      Paris         10045     23.0     47.0      NaN               KLM(!)
1      Milan         10055      NaN      NaN      NaN    <Air France> (12)
2  Stockholm         10065     24.0     43.0     87.0  (British Airways. )
3      Paris         10075     13.0      NaN      NaN       12. Air France
4     London         10085     67.0     32.0      NaN          "Swiss Air"